[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg/800px-The_Great_Gatsby_Cover_1925_Retouched.jpg",
    "review": "A timeless classic depicting the decadence and disillusionment of the Jazz Age. Set in the summer of 1922, the story follows the mysterious Jay Gatsby and his pursuit of wealth and love. F. Scott Fitzgerald's evocative prose captures the essence of the roaring twenties and explores themes of love, wealth, and the American Dream. The Great Gatsby remains a must-read for its portrayal of the American experience during the Jazz Age.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Romance", "Tragedy"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://mir-s3-cdn-cf.behance.net/project_modules/1400/b468d093312907.5e6139cf2ab03.png",
    "review": "A dystopian masterpiece that explores themes of surveillance and totalitarianism. Set in a future world where the government controls every aspect of life, George Orwell's 1984 is a chilling portrayal of a society ruled by fear and oppression. The novel follows protagonist Winston Smith as he rebels against the oppressive regime of Big Brother and seeks freedom and truth. 1984 is a stark warning against the dangers of totalitarianism and remains relevant in today's world.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Dystopian", "Political", "Classic"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://m.media-amazon.com/images/M/MV5BNmVmYzcwNzMtMWM1NS00MWIyLThlMDEtYzUwZDgzODE1NmE2XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
    "review": "A poignant tale of racial injustice and moral growth in the American South. Set in the fictional town of Maycomb, Alabama, during the 1930s, To Kill a Mockingbird follows young Scout Finch as she learns about empathy, compassion, and justice. Harper Lee's powerful narrative explores themes of racism, prejudice, and social justice through the trial of Tom Robinson, a black man falsely accused of raping a white woman. To Kill a Mockingbird is a timeless classic that continues to resonate with readers of all ages.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Coming of age", "Legal drama", "Social issues"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://npr.brightspotcdn.com/dims4/default/f735808/2147483647/strip/true/crop/363x574+0+0/resize/880x1392!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Flegacy%2Fsites%2Fwkar%2Ffiles%2Fcatcher_in_the_rye_cover.png",
    "review": "A raw and honest portrayal of teenage angst and alienation. J.D. Salinger's The Catcher in the Rye follows Holden Caulfield, a disillusioned teenager, as he navigates the complexities of adolescence in 1950s America. Through Holden's unique voice and perspective, Salinger explores themes of identity, alienation, and the search for authenticity. The novel's enduring popularity lies in its relatable portrayal of the universal struggles of youth and the human condition.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Young adult", "Cultural", "Identity"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://cdn.kobo.com/book-images/7a557cb3-f72a-47c3-992b-951c9566e4d4/1200/1200/False/the-fellowship-of-the-ring-the-lord-of-the-rings-book-1-1.jpg",
    "review": "An epic fantasy saga that transports readers to a meticulously crafted world filled with magic and adventure. Follow the journey of Frodo Baggins and the Fellowship of the Ring as they embark on a quest to destroy the One Ring and defeat the dark lord Sauron. J.R.R. Tolkien's richly detailed narrative, complete with diverse characters, intricate plots, and vivid landscapes, has captivated readers for generations. The Lord of the Rings is a timeless masterpiece that continues to inspire readers and writers alike.",
    "totalPages": 1178,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure", "High fantasy"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 6,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://m.media-amazon.com/images/I/71Q1tPupKjL._AC_UF1000,1000_QL80_.jpg",
    "review": "A delightful comedy of manners with unforgettable characters and witty social commentary. Jane Austen's Pride and Prejudice follows the tumultuous relationship between the spirited Elizabeth Bennet and the proud Mr. Darcy amidst the backdrop of Regency-era England. Through sharp wit and incisive satire, Austen explores themes of love, class, and societal expectations. Pride and Prejudice remains one of the most beloved and enduring works of English literature, cherished for its timeless portrayal of human nature and its enduring message of love and self-discovery.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Romance", "Satire", "Regency era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  }
  ]
  